mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	if (i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCCNT,
	    &pac_acccnt, sizeof(pac_acccnt)) != sizeof(pac_acccnt)) {
		printf("read pac_acccnt fail\n");
		pac_acccnt.acccnt_count = 0;
		return;
	} 
	printf("\n %d count %lu", NCANOK, pac_acccnt.acccnt_count);
	l600_current_count += pac_acccnt.acccnt_count;

	for (c = 0; c < 4; c++) {
		if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
			continue;

		acc_value = 0;
		if (i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCV1 + c,
		    &acc_value, 7) != 7) {
			printf("read acc_value[%d] fail\n", c);
			continue;
		}
		if (acc_value & 0x0080000000000000) {
			/* adjust negative value */
			acc_value |= 0xff00000000000000;
		}
		l600_current_acc[c] += acc_value;
		/* batt_i = acc_value * 0.00075 * 100 */
		v = (double)acc_value * 0.075 / pac_acccnt.acccnt_count;
		/* adjust with calibration data */
		switch(c) {
		case 0:
			v = v * 0.988689144013892;
			break;
		case 1:
			v = v * 1.00930129713152;
			break;
		case 2:
			v = v * 4.06331342566096;
			break;
		}
		batt_i[c] = v + 0.5;
		printf(" %d %4.4fA", c, v / 100);
		/* volt = vbus * 0.000488 */
		/* batt_v = voltages_acc * 0.000488 * 100 / 10; */
		/* adjust by 0.99955132 from calibration data */
		v = (double)voltages_acc[c] * 0.0048778104;
		batt_v[c] = v + 0.5;
		printf(" %4.3fV", v / 100);
	}
}

/* i2c OLED specific */

#define I2C_BUFSZ 128
unsigned char i2c_buf[I2C_BUFSZ];
unsigned char i2c_pt;

static char
i2c_writecontrol(const char address, uint8_t len)
{
	return i2c_writereg(address, 0, &i2c_buf[0], len);
}

static char
i2c_writedata(const char address, uint8_t len)
{
	return i2c_writereg_dma(address, 0x40, &i2c_buf[0], len);
}

#define OLED_CTRL(c) \
        {i2c_buf[i2c_pt++] = (c);}

#define OLED_CTRL_RESET {i2c_pt = 0;}

#define OLED_CTRL_WRITE if (i2c_writecontrol(OLED_ADDR, (i2c_pt)) == 0) { \
	    printf("OLED_CTRL %d %ld fail\n", (int)i2c_buf[0], (long)(i2c_pt));\
	} \
	OLED_CTRL_RESET
	
#define OLED_DATA(l) if (i2c_writedata(OLED_ADDR, (l)) == 0) { \
	    printf("OLED_DATA %ld fail\n", (long)(l)); \
	}

static void displaybuf_small(void)
{
	const unsigned char *font;
	char *cp;
	unsigned char i;

	OLED_CTRL_RESET;
	/* set column address */
	OLED_CTRL(oled_col & 0x0f); OLED_CTRL(0x10 | (oled_col >> 4));
	/* set page address */
	OLED_CTRL((oled_line & 0x07 ) | 0xb0 );
	OLED_CTRL_WRITE;

	i2c_pt = 0;
	for (cp = oled_displaybuf; *cp != '\0'; cp++) {
		font = get_font5x8(*cp);
		for (i = 0; i < 5; i++) {
			i2c_buf[i2c_pt++] = font[i];
		}
	}
	OLED_DATA(i2c_pt);
}


int
main(void)
{
	char c;
	uint16_t l;
	uint8_t i2cr;
	pac_accumcfg_t pac_accumcfg;
	pac_neg_pwr_fsr_t pac_neg_pwr_fsr;
	static unsigned int poll_count;
	uint16_t t0;
	static int32_t voltages_acc_cur[4];
	uint8_t new_boot;


	devid = 0;
	revid = 0;
	nmea2000_user_id = 0;
	/* read devid and user IDs */
	TBLPTR = 0x200000;
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id;");
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id + 1;");
	TBLPTR = 0x3ffffc;
	asm("tblrd*+;");
	asm("movff TABLAT, _revid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _revid + 1;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid + 1;");

	/* disable unused modules */
	PMD0 = 0x7a; /* keep clock and IOC */
#ifdef USE_TIMER2
	PMD1 = 0xfa; /* keep timer0/timer2 */
	PMD2 = 0x03; /* keep can module */
#else
	PMD1 = 0xfe; /* keep timer0 */
	PMD2 = 0x02; /* keep can module, TU16A */
#endif
	PMD3 = 0xdf; /* keep ADC */
	PMD4 = 0xff;
	PMD5 = 0xff;
	PMD6 = 0xf6; /* keep UART1 and I2C */
	PMD7 = 0xff;
	PMD8 = 0xfe; /* keep DMA1 */

	ANSELC = 0;

	ANSELB = 0;
	/* CANRX on RB3 */
	CANRXPPS = 0x0B;
	/* CANTX on RB2 */
	LATBbits.LATB2 = 1; /* output value when idle */
	TRISBbits.TRISB2 = 0;
	RB2PPS = 0x46;

	ANSELA = 0x2e; /* RA1, RA2, RA3 and RA5 analog */
	LATA = 0;
	OLED_RSTN = 0;
	NDOWN = 0;
	TRISAbits.TRISA4 = 0; /* RA4/OLED_RSTN as outpout */
	TRISCbits.TRISC7 = 0; /* RC7/NDOWN output */

	/* configure watchdog timer for 2s */
	WDTCON0 = 0x16;
	WDTCON1 = 0x07;

	/* configure sleep mode: PRI_IDLE */
	CPUDOZE = 0x80;

	/*
	 * configure priotities memory access priorities
	 * ISR > DMA1 > main
	 */
	PRLOCK = 0x55;
	PRLOCK = 0xAA;
	PRLOCKbits.PRLOCKED = 0;
	ISRPR = 0;
	MAINPR = 4;
	DMA1PR = 3;
	PRLOCK = 0x55;
	PRLOCK = 0xAA;
	PRLOCKbits.PRLOCKED = 1;


	softintrs.byte = 0;
	counter_10hz = 25;
	counter_1hz = 10;
	seconds = 0;

	for (c = 0; c < 4; c++) {
		voltages_acc_cur[c] = 0;
		l600_current_acc[c] = 0;
		l600_voltages_acc[c] = 0;
	}
	l600_current_count = 0;

	IPR1 = 0;
	IPR2 = 0;
	IPR3 = 0;
	IPR4 = 0;
	IPR5 = 0;
	IPR6 = 0;
	IPR7 = 0;
	IPR8 = 0;
	IPR9 = 0;
	IPR10 = 0;
	IPR11 = 0;
	IPR12 = 0;
	IPR13 = 0;
	IPR14 = 0;
	IPR15 = 0;
	INTCON0 = 0;
	INTCON1 = 0;
	INTCON0bits.IPEN=1; /* enable interrupt priority */

	USART_INIT(0);

	/* configure timer0 as free-running counter at 9.765625Khz * 4 */
	T0CON0 = 0x0;
	T0CON0bits.MD16 = 1; /* 16 bits */
	T0CON1 = 0x48; /* 01001000 Fosc/4, sync, 1/256 prescale */
	PIR3bits.TMR0IF = 0;
	PIE3bits.TMR0IE = 0; /* no interrupt */
	T0CON0bits.T0EN = 1;

#ifdef USE_TIMER2
	/* configure timer2 for 250Hz interrupt */
	T2CON = 0x44; /* b01000100: postscaller 1/5, prescaler 1/16 */
	T2PR = 125; /* 250hz output */
	T2CLKCON = 0x01; /* Fosc / 4 */
	T2CONbits.TMR2ON = 1;
	PIR3bits.TMR2IF = 0;
	IPR3bits.TMR2IP = 1; /* high priority interrupt */
	PIE3bits.TMR2IE = 1;
#else
	/* configure UTMR for 10Hz interrupt */
	TU16ACON0 = 0x04; /* period match IE */
	TU16ACON1 = 0x00;
	TU16AHLT = 0x00; /* can't use hardware reset because of HW bug */
	TU16APS = 249; /* prescaler = 250 -> 40000 Hz */
	TU16APRH = (4000 >> 8) & 0xff;
	TU16APRL = 4000 & 0xff;
	TU16ACLK = 0x2; /* Fosc */
	TUCHAIN = 0;
	TU16ACON0bits.ON = 1;
	TU16ACON1bits.CLR = 1;
	IPR0bits.TU16AIP = 1; /* high priority interrupt */
	PIE0bits.TU16AIE = 1;
#endif

	i2c_init();

	INTCON0bits.GIEH=1;  /* enable high-priority interrupts */   
	INTCON0bits.GIEL=1; /* enable low-priority interrrupts */   

	printf("hello user_id 0x%lx devid 0x%x revid 0x%x\n", nmea2000_user_id, devid, revid);

	printf("n2k_init\n");
	nmea2000_init();
	poll_count = timer0_read();

